Wannesgarrevoet/nbus-esp32/firmware/firmware.ino
bool mqttConnect() {
  if (cfg.host.isEmpty()) return false;
  mqtt.setServer(cfg.host.c_str(), cfg.port);
  mqtt.setBufferSize(512);

  String clientId = String(NBUS_DEVICE_ID) + "-" + String((uint32_t)ESP.getEfuseMac(), HEX);
  const char* user = cfg.user.isEmpty() ? nullptr : cfg.user.c_str();
  const char* pass = cfg.pass.isEmpty() ? nullptr : cfg.pass.c_str();

  bool ok = mqtt.connect(clientId.c_str(), user, pass,
                         statusTopic().c_str(), 0, true, "offline");
  if (ok) {
    mqtt.publish(statusTopic().c_str(), "online", true);
    g_discoverySent = false;  // re-send discovery on (re)connect
    g_mqttFailCount = 0;
    Serial.println(F("[mqtt] connected"));
  } else {
    Serial.print(F("[mqtt] connect failed, state="));
    Serial.println(mqtt.state());
  }
  return ok;
}

// --------------------------------------------------------------------------
// State publishing
// --------------------------------------------------------------------------
void publishState() {
  const NBusState& s = parser.state();
  const uint32_t now = millis();

  // Battery
  if (s.batt_voltage_valid && (now - g_lastBattMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    if (s.batt_soc_valid)     doc["soc"]     = s.batt_soc;
    if (s.batt_voltage_valid) doc["voltage"] = roundf(s.batt_voltage * 100) / 100.0;
    if (s.batt_wh_valid)       doc["energy"]   = s.batt_wh;
    if (s.batt_quality_valid)  doc["quality"]  = s.batt_quality;
    if (s.batt_capacity_valid) doc["capacity"] = s.batt_capacity_ah;
    // These two alternate: 0x34 sends FFFF for whichever direction does not apply, so one
    // of them is invalid at all times. Omitting the key would leave the template rendering
    // an empty string, which Home Assistant treats as "no update" — the entity would then
    // hold the last figure from the opposite direction indefinitely. An explicit null
    // renders as "None", which does set the state to unknown.
    if (s.batt_to_empty_valid) doc["to_empty"] = s.batt_to_empty_min; else doc["to_empty"] = nullptr;
    if (s.batt_to_full_valid)  doc["to_full"]  = s.batt_to_full_min;  else doc["to_full"]  = nullptr;
    if (s.batt_discharged_valid) doc["discharged"] = s.batt_discharged_wh;
    if (s.batt_charged_valid)    doc["charged"]    = s.batt_charged_wh;
    if (s.batt_current_valid) {
      doc["current"] = roundf(s.batt_current * 100) / 100.0;
      doc["power"]   = roundf(s.batt_voltage * s.batt_current * 10) / 10.0;
    }
    bool anyCell = s.cell_valid[0] || s.cell_valid[1] || s.cell_valid[2] || s.cell_valid[3];
    if (anyCell && (now - g_lastCellMs) < NBUS_STALE_MS) {
      JsonArray cells = doc["cells"].to<JsonArray>();
      for (int i = 0; i < 4; ++i) cells.add(roundf(s.cell_v[i] * 1000) / 1000.0);
    }
    String payload; serializeJson(doc, payload);
    mqtt.publish(batteryTopic().c_str(), payload.c_str(), true);
  }

  // Solar charger
  if (s.solar_valid && (now - g_lastSolarMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.solar_voltage * 100) / 100.0;
    doc["current"] = roundf(s.solar_current * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(solarTopic().c_str(), payload.c_str(), true);
  }

  // Starter battery
  if (s.starter_valid && (now - g_lastStarterMs) < NBUS_STALE_MS) {
    JsonDocument doc;
    doc["voltage"] = roundf(s.starter_voltage * 100) / 100.0;
    String payload; serializeJson(doc, payload);
    mqtt.publish(starterTopic().c_str(), payload.c_str(), true);
  }
}

// --------------------------------------------------------------------------
// Raw register mirror
//
// Registers the parser understands become named sensors above. Everything else would
// otherwise be discarded, and that is precisely the data a post-mortem needs: on a
// healthy bus the candidate alarm registers (0xC0, 0xF0, 0xF1, 0xF2) are all zero, which
// looks exactly like an unused register. Only a capture taken while the fault is
// happening can tell those apart, and the fault is intermittent — so it has to be
// recorded continuously, unattended.
//
// Each pair gets its own retained topic, so the broker timestamps every change for free
// and a constant register costs one message ever. No discovery config is published:
// naming an entity would claim a meaning we have not established.
// --------------------------------------------------------------------------
struct RegMirror {
  uint8_t  nad = 0, reg = 0;
  uint8_t  data[4] = {0, 0, 0, 0};
  uint32_t lastPubMs = 0;
  bool     used = false;
};
RegMirror g_regMirror[NBUS_REG_MIRROR_SLOTS];

void mirrorRegister(uint8_t nad, uint8_t reg, const uint8_t* d) {
  if (!mqtt.connected()) return;

  RegMirror* slot = nullptr;
  for (auto& m : g_regMirror) {
    if (m.used && m.nad == nad && m.reg == reg) { slot = &m; break; }
    if (!m.used && slot == nullptr) slot = &m;  // remember the first free slot
  }
  if (slot == nullptr) return;  // table full; a fixed table cannot be flooded by noise

  const bool isNew   = !slot->used;
  const bool changed = isNew || memcmp(slot->data, d, 4) != 0;
  const uint32_t now = millis();

  // Throttle per register rather than globally. A register that never moves publishes
  // the instant it finally does; only a chronically noisy one is rate-limited, and it is
  // the quiet ones that matter here.
  if (!changed) return;
  if (!isNew && (now - slot->lastPubMs) < NBUS_REG_MIRROR_MS) return;

  slot->used = true;
  slot->nad  = nad;
  slot->reg  = reg;
  memcpy(slot->data, d, 4);
  slot->lastPubMs = now;

  char topic[64];
  snprintf(topic, sizeof(topic), "%s/reg/%02X/%02X", cfg.base.c_str(), nad, reg);
  char payload[9];
  snprintf(payload, sizeof(payload), "%02X%02X%02X%02X", d[0], d[1], d[2], d[3]);
  mqtt.publish(topic, payload, true);
}

// --------------------------------------------------------------------------
// Raw frame ring buffer
//
// Every checksum-valid frame lands here with a timestamp. Nothing is written to
// flash while the bus is healthy — at ~12 frames/s that would wear the chip out
// in days, and the recent past is the only part anyone wants anyway. The ring is
// flushed to flash exactly once, when the bus falls silent, which is the event
// this device exists to catch.
//
// Statically allocated on purpose. 48 KB is a large enough bite that a runtime
// malloc failure would be a real possibility, and it would surface as "captures
// nothing" long after the fact. At link time it either fits or it does not.
// --------------------------------------------------------------------------
static RawEntry g_ring[NBUS_RAW_RING_ENTRIES];
static uint32_t g_ringHead  = 0;   // next slot to write
static uint32_t g_ringTotal = 0;   // frames ever recorded; also tells us whether we wrapped
static bool     g_busSilent = false;
static uint32_t g_dumpSeq = 0;

// Single-threaded by construction: readLin() and httpServer.handleClient() both
// run from loop(), so the ring needs no locking. Keep it that way.
inline uint32_t ringCount() {
  return (g_ringTotal < NBUS_RAW_RING_ENTRIES) ? g_ringTotal : NBUS_RAW_RING_ENTRIES;
}
inline uint32_t ringOldest() {
  return (g_ringTotal < NBUS_RAW_RING_ENTRIES) ? 0 : g_ringHead;
}

void ringPush(const uint8_t* d) {
  RawEntry& e = g_ring[g_ringHead];
  e.ms = millis();
  memcpy(e.d, d, 8);
  g_ringHead = (g_ringHead + 1) % NBUS_RAW_RING_ENTRIES;
  g_ringTotal++;
}

int formatEntry(const RawEntry& e, char* out, size_t n) {
  return snprintf(out, n, "%lu %02X %02X %02X %02X %02X %02X %02X %02X\n",
                  (unsigned long)e.ms,
                  e.d[0], e.d[1], e.d[2], e.d[3], e.d[4], e.d[5], e.d[6], e.d[7]);
}

// --------------------------------------------------------------------------
// Raw dump persistence
// --------------------------------------------------------------------------
bool g_fsReady = false;

void rawFsInit() {
  g_fsReady = LittleFS.begin(true);   // format on first boot if unformatted
  if (!g_fsReady) {
    Serial.println(F("[raw] LittleFS mount failed — dumps disabled"));
    return;
  }
  if (!LittleFS.exists(NBUS_RAW_DUMP_DIR)) LittleFS.mkdir(NBUS_RAW_DUMP_DIR);
  prefs.begin("nbus", true);
  g_dumpSeq = prefs.getUInt("dumpseq", 0);
  prefs.end();
  Serial.printf("[raw] LittleFS %u/%u bytes used\n",
                (unsigned)LittleFS.usedBytes(), (unsigned)LittleFS.totalBytes());
}

// Keep only the newest NBUS_RAW_MAX_DUMPS files. Sequence numbers are monotonic
// across reboots (they live in NVS), so "lowest number" really is "oldest" —
// millis() would not survive the very reset we are trying to record.
// Bounded, and it gives up the moment a removal fails: this runs unattended from
// rawPersist() at the exact moment of the fault, so spinning here would cost us the
// capture the whole device exists to take.
void rawPruneDumps() {
  for (int guard = 0; guard < NBUS_RAW_MAX_DUMPS + 4; guard++) {
    File dir = LittleFS.open(NBUS_RAW_DUMP_DIR);
    if (!dir) return;
    int count = 0;
    uint32_t lowest = 0xFFFFFFFF;
    String lowestName;
    for (File f = dir.openNextFile(); f; f = dir.openNextFile()) {
      count++;
      String nm = String(f.name());
      uint32_t seq = (uint32_t)strtoul(nm.c_str(), nullptr, 10);
      if (seq < lowest) { lowest = seq; lowestName = nm; }
    }
    dir.close();
    if (count <= NBUS_RAW_MAX_DUMPS || lowestName.isEmpty()) return;
    if (!LittleFS.remove(String(NBUS_RAW_DUMP_DIR) + "/" + lowestName)) return;
  }
}

void rawPersist(const char* reason) {
  if (!g_fsReady || ringCount() == 0) return;
  g_dumpSeq++;
  prefs.begin("nbus", false);
  prefs.putUInt("dumpseq", g_dumpSeq);
  prefs.end();
  char path[48];
  snprintf(path, sizeof(path), "%s/%06lu.txt", NBUS_RAW_DUMP_DIR, (unsigned long)g_dumpSeq);
  File f = LittleFS.open(path, "w");
  if (!f) { Serial.printf("[raw] cannot write %s\n", path); return; }

  const uint32_t n = ringCount();
  f.printf("# nbus raw dump v1\n# fw %s (%s)\n# reason %s\n",
           NBUS_FW_VERSION, NBUS_FW_BUILD, reason);
  f.printf("# written_at_ms %lu  frames %lu  total_seen %lu\n",
           (unsigned long)millis(), (unsigned long)n, (unsigned long)g_ringTotal);
  f.print(F("# t_ms NAD PCI SID REG D0 D1 D2 D3\n"));

  char line[48];
  uint32_t idx = ringOldest();
  for (uint32_t i = 0; i < n; ++i) {
    formatEntry(g_ring[idx], line, sizeof(line));
    f.print(line);
    idx = (idx + 1) % NBUS_RAW_RING_ENTRIES;
    if ((i & 0xFF) == 0) esp_task_wdt_reset();   // 4096 flash writes outlast a 30 s watchdog
  }
  f.close();
  Serial.printf("[raw] wrote %s (%lu frames, reason: %s)\n", path, (unsigned long)n, reason);
  rawPruneDumps();

